In [1]:
#methods come with brackets at the end()  while attributes have just .whatever without the brackets at the end
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(1994)

In [4]:
df = pd.DataFrame(randn(4,5), ['A','B','C','D'], ['1','2','3','4','5'])
df
#pd.DataFrame has parameters of data then index(rows) then columns to tabilize it

          1         2         3         4         5
A -0.147792 -0.033930 -0.152681  0.425649  0.140394
B  0.472092 -0.191980  0.169801  2.231222  0.135851
C -2.790513 -1.771251  1.526137  0.898105 -1.167302
D  2.312729  0.321257  0.170068 -0.767935 -0.667698

In [5]:
df['1']
#Printout all the rows of this particular column, looks like a series now

A   -0.147792
B    0.472092
C   -2.790513
D    2.312729
Name: 1, dtype: float64

In [8]:
type(df['1'])
#df of column index 1 is now a series

pandas.core.series.Series

In [9]:
type(df)
#df is a dataframe

pandas.core.frame.DataFrame

In [14]:
df.1
#Advicable not to use this syntax cuz of confusion n code error
# 1 is displayed as an internal value so not advicable to use as a column name
#could have issues with the code later, if it was a letter then it would have printed the rows series normally

SyntaxError: invalid syntax (<ipython-input-14-fcc4ebf510aa>, line 1)

In [15]:
df['A']
#Printing the rows doesnt work like the columns

KeyError: 'A'

In [16]:
df[['1','2']]
#Printing multiple columns
#This is not a series but a dataframe now

          1         2
A -0.147792 -0.033930
B  0.472092 -0.191980
C -2.790513 -1.771251
D  2.312729  0.321257

In [17]:
df['12'] = df['1'] + df['2']
#For adding a new column

In [18]:
df

          1         2         3         4         5        12
A -0.147792 -0.033930 -0.152681  0.425649  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  2.231222  0.135851  0.280112
C -2.790513 -1.771251  1.526137  0.898105 -1.167302 -4.561765
D  2.312729  0.321257  0.170068 -0.767935 -0.667698  2.633986

In [19]:
df.drop('4', axis=1)
#Removing a column, the default axis is 0 which is rolls so you have to specify the axis

          1         2         3         5        12
A -0.147792 -0.033930 -0.152681  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  0.135851  0.280112
C -2.790513 -1.771251  1.526137 -1.167302 -4.561765
D  2.312729  0.321257  0.170068 -0.667698  2.633986

In [20]:
df
#The .drop change didnt stay inplace

          1         2         3         4         5        12
A -0.147792 -0.033930 -0.152681  0.425649  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  2.231222  0.135851  0.280112
C -2.790513 -1.771251  1.526137  0.898105 -1.167302 -4.561765
D  2.312729  0.321257  0.170068 -0.767935 -0.667698  2.633986

In [21]:
df.drop('4',axis=1,inplace=True)
#Use inplace true to make the .drop change permanent for df in general

In [22]:
df

          1         2         3         5        12
A -0.147792 -0.033930 -0.152681  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  0.135851  0.280112
C -2.790513 -1.771251  1.526137 -1.167302 -4.561765
D  2.312729  0.321257  0.170068 -0.667698  2.633986

In [23]:
df.drop('C')
#df.drop('C',axis=0) same output

          1         2         3         5        12
A -0.147792 -0.033930 -0.152681  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  0.135851  0.280112
D  2.312729  0.321257  0.170068 -0.667698  2.633986

In [24]:
df

          1         2         3         5        12
A -0.147792 -0.033930 -0.152681  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  0.135851  0.280112
C -2.790513 -1.771251  1.526137 -1.167302 -4.561765
D  2.312729  0.321257  0.170068 -0.667698  2.633986

In [25]:
df.shape
#it shows that its a 2 dimensional matrix with 4 rows n 5 columns hence axis 0 = rows n axis 1 = columns

(4, 5)

In [26]:
df.loc['C']
#location of a row
#It returns a series formation too like in columns

1    -2.790513
2    -1.771251
3     1.526137
5    -1.167302
12   -4.561765
Name: C, dtype: float64

In [27]:
df.iloc[2]
#Numerical location of a row,its at index 2

1    -2.790513
2    -1.771251
3     1.526137
5    -1.167302
12   -4.561765
Name: C, dtype: float64

In [28]:
df.loc['A','3']
#same as numpy row then column

-0.15268103578895176

In [29]:
df.loc[['A','C'],['2','5','12']]
#Selecting multiple rows n columns

          2         5        12
A -0.033930  0.140394 -0.181723
C -1.771251 -1.167302 -4.561765

In [30]:
df[df>0]
#conditional statement for dataframes
#returns all numbers greater than zero n NaN the rest

          1         2         3         5        12
A       NaN       NaN       NaN  0.140394       NaN
B  0.472092       NaN  0.169801  0.135851  0.280112
C       NaN       NaN  1.526137       NaN       NaN
D  2.312729  0.321257  0.170068       NaN  2.633986

In [31]:
df[df['5']>0]
#This will return all rolls with positive except with the one/ones less than zero
#If its less than 0 in column 5 then the entire roll is deleted

          1        2         3         5        12
A -0.147792 -0.03393 -0.152681  0.140394 -0.181723
B  0.472092 -0.19198  0.169801  0.135851  0.280112

In [32]:
dimdf = df[df['5']>0]
dimdf['2']
#2 steps for printing column 2 series of the newly formed dataframe

A   -0.03393
B   -0.19198
Name: 2, dtype: float64

In [33]:
df[df['5']>0]['2']
#1 step for the above, stacking brackets on brackets

A   -0.03393
B   -0.19198
Name: 2, dtype: float64

In [38]:
df[df['5']>0][['2','1']]
#Multiple columns for above, 2 brackets for multiple entries

         2         1
A -0.03393 -0.147792
B -0.19198  0.472092

In [39]:
booldf = df['5']>0
dimdf = df[booldf]
dcol = ['2','1']
dimdf[dcol]
#1 step above to 4 steps here, breaking it down

         2         1
A -0.03393 -0.147792
B -0.19198  0.472092

In [42]:
df[(df['5']>0) & (df['1']<1)]
#Multiple conditionals, & is AND

          1        2         3         5        12
A -0.147792 -0.03393 -0.152681  0.140394 -0.181723
B  0.472092 -0.19198  0.169801  0.135851  0.280112

In [43]:
df[(df['5']>0) | (df['1']<1)]
#Thereas | is OR

          1         2         3         5        12
A -0.147792 -0.033930 -0.152681  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  0.135851  0.280112
C -2.790513 -1.771251  1.526137 -1.167302 -4.561765

In [44]:
df

          1         2         3         5        12
A -0.147792 -0.033930 -0.152681  0.140394 -0.181723
B  0.472092 -0.191980  0.169801  0.135851  0.280112
C -2.790513 -1.771251  1.526137 -1.167302 -4.561765
D  2.312729  0.321257  0.170068 -0.667698  2.633986

In [45]:
df.reset_index()
#If you want to make the numerical index of 0 to 3 to show
#your named index is now under index row
#Put inplace=True in the bracket to permanent the change to df

  index         1         2         3         5        12
0     A -0.147792 -0.033930 -0.152681  0.140394 -0.181723
1     B  0.472092 -0.191980  0.169801  0.135851  0.280112
2     C -2.790513 -1.771251  1.526137 -1.167302 -4.561765
3     D  2.312729  0.321257  0.170068 -0.667698  2.633986

In [46]:
newindex = 'DM DJ AD BY'.split()
newindex
#The amount of new index should match the amount of the old
#Adding a new index values with .split

['DM', 'DJ', 'AD', 'BY']

In [47]:
df['Names'] = newindex
df
#Naming the new index column as Names

          1         2         3         5        12 Names
A -0.147792 -0.033930 -0.152681  0.140394 -0.181723    DM
B  0.472092 -0.191980  0.169801  0.135851  0.280112    DJ
C -2.790513 -1.771251  1.526137 -1.167302 -4.561765    AD
D  2.312729  0.321257  0.170068 -0.667698  2.633986    BY

In [48]:
df.set_index('Names')
#Using set it replaces the former index, deleting it
#Use inplace beside names to permanent it
#Set replaces while reset adds

              1         2         3         5        12
Names
DM    -0.147792 -0.033930 -0.152681  0.140394 -0.181723
DJ     0.472092 -0.191980  0.169801  0.135851  0.280112
AD    -2.790513 -1.771251  1.526137 -1.167302 -4.561765
BY     2.312729  0.321257  0.170068 -0.667698  2.633986

In [49]:
#Index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
#When there are diff levels of index in a dataframe

In [53]:
dfm = pd.DataFrame(randn(6,2),hier_index,['A','B'])
dfm
#Capital letters in pandas methods calling is compulsory or error report
#dataframe parameters of data,index/row,columns
#Create a multi level index dataframe with random numbers in a 6 by 2 form, it has to match amount of index n columns or else its an error
#parameters of the random numbers in rows by column, the hierachy index formed, then the column names

             A         B
G1 1 -1.538573  0.372708
   2  0.731881 -1.231488
   3 -1.844402  0.828352
G2 1  1.396288  0.300446
   2  0.363335 -1.068221
   3 -0.690385  1.940461

In [54]:
dfm.loc['G1']
#Printing the outside index

          A         B
1 -1.538573  0.372708
2  0.731881 -1.231488
3 -1.844402  0.828352

In [56]:
dfm.loc['G1'].loc[2]
#No parenthesis needed again when calling deeper or else error
#Printing the inside index from the outside one, just keep calling deeper n deeper

A    0.731881
B   -1.231488
Name: 2, dtype: float64

In [57]:
dfm.index.names

FrozenList([None, None])

In [59]:
dfm.index.names = ['Group','Num']
dfm
#Naming the outside n inside indexes
#Putting a column on the outside n inside rows

                  A         B
Group Num
G1    1   -1.538573  0.372708
      2    0.731881 -1.231488
      3   -1.844402  0.828352
G2    1    1.396288  0.300446
      2    0.363335 -1.068221
      3   -0.690385  1.940461

In [60]:
dfm.loc['G1'].loc[3]['A']
#Printing a specific value, indexing

-1.8444023360000767

In [61]:
dfm.xs(1,level='Num')
#Specify what you want as far as Num = 1,index of 1 in Num then level to pass in the name/column of the index (Num)
#xs/Cross section method is diff from loc/location method when trying to grab values of 2 diff outsides with the same inside index

              A         B
Group
G1    -1.538573  0.372708
G2     1.396288  0.300446